Documents/Лео_ФактТрудозатрат/Лео_ФактТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_ФактТрудозатрат</name>
  <basedOn>Document.ОтчетПроизводстваЗаСмену</basedOn>
  <registerRecords>AccumulationRegister.Лео_ФакТрудозатрат</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Персонал</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Лео_ДолжностиПереработчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.Лео_сменыПереработчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОборудования</name>
      <type>
        <types>CatalogRef.Лео_оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ТехнологическаяОперация</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ТехнологическиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лео_ВремяНачалаРаботы</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Лео_ВремяОкончанияРаботы</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Лео_Простои</name>
      <type>
        <types>CatalogRef.Лео_Простои</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AccumulationRegisters/Лео_ФакТрудозатрат/Лео_ФакТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Лео_ФакТрудозатрат</name>
  <resources>
    <name>Выпуск</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОПЗС</name>
    <type>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
    </type>
  </attributes>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПродукцияСерия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Лео_ДолжностиПереработчиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Техоперация</name>
    <type>
      <types>CatalogRef.ТехнологическиеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Лео_сменыПереработчиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипТехоперации</name>
    <type>
      <types>CatalogRef.Лео_ТипТехОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.Лео_оборудование</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

InformationRegisters/Лео_стоимостьПереработчиков/Лео_стоимостьПереработчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_стоимостьПереработчиков</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Лео_ДолжностиПереработчиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Лео_сменыПереработчиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДолжностьПереработчика</name>
    <type>
      <types>CatalogRef.Лео_ДолжностиПереработчиков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Documents/Лео_ФактТрудозатрат/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ДокументОснование = ДанныеЗаполнения;
 //    сообщить(ДокументОснование);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	   	
	// регистр Лео_ФакТрудозатрат Приход
	Движения.Лео_ФакТрудозатрат.Записывать = Истина;
	Движения.Лео_ФакТрудозатрат.Очистить();
	Для Каждого ТекСтрокаПерсонал Из Персонал Цикл
		Движение = Движения.Лео_ФакТрудозатрат.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		
		Если ЗначениеЗаполнено(ДокументОснование) тогда
			получитьстроку= ДокументОснование.Продукция.Получить(0);
			Движение.Продукция = получитьстроку.Номенклатура;
			Движение.ПродукцияСерия = получитьстроку.СерияНоменклатуры;
			Движение.Выпуск = получитьстроку.Количество;
			Движение.ОПЗС   = ДокументОснование;
		конецЕсли;
		
		Движение.Должность = ТекСтрокаПерсонал.Должность;
		Движение.Контрагент = ТекСтрокаПерсонал.Контрагент;
		Движение.Техоперация = ТекСтрокаПерсонал.ТехнологическаяОперация;
		Движение.Смена = ТекСтрокаПерсонал.Смена;
		Движение.ТипТехоперации = ТекСтрокаПерсонал.ТехнологическаяОперация.ТипОперации_лео;
		Движение.Количество = ТекСтрокаПерсонал.Количество;
		
		//+++ Жигалев 12.05.2023
		Движение.Подразделение   = ТекСтрокаПерсонал.Подразделение;
		Движение.ВидОборудования = ТекСтрокаПерсонал.ВидОборудования;
		//--- Жигалев 12.05.2023
		
	    цена=ПолучитьЦену(ТекСтрокаПерсонал);
		Движение.Сумма = цена*ТекСтрокаПерсонал.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	//+++ Жигалев 05.12.2023
	Если ЗначениеЗаполнено(ДокументОснование) тогда
		ОПЗС = ДокументОснование.ПолучитьОбъект();
		ОПЗС.Лео_ФактТрудозатрат = Ссылка;
		ОПЗС.Записать();	
	КонецЕсли;
	//--- Жигалев 05.12.2023

	
	
	
	
КонецПроцедуры

Функция   ПолучитьЦену(ТекСтрокаПерсонал)
	      //{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_стоимостьПереработчиковСрезПоследних.ЦенаБезНДС как Цена
		|ИЗ
		|	РегистрСведений.Лео_стоимостьПереработчиков.СрезПоследних(&дата, ) КАК Лео_стоимостьПереработчиковСрезПоследних
		|ГДЕ
		|	Лео_стоимостьПереработчиковСрезПоследних.Должность = &Должность
		|	И Лео_стоимостьПереработчиковСрезПоследних.Смена = &Смена
		|	И Лео_стоимостьПереработчиковСрезПоследних.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("дата", дата);

	Запрос.УстановитьПараметр("Должность", ТекСтрокаПерсонал.Должность);
	Запрос.УстановитьПараметр("Контрагент", ТекСтрокаПерсонал.Контрагент);
	Запрос.УстановитьПараметр("Смена", ТекСтрокаПерсонал.Смена);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    цена=0;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		цена=ВыборкаДетальныеЗаписи.Цена;

		

		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
    возврат(цена);

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		// Вставить содержимое обработчика.
		
	////+++ Жигалев 05.12.2023
	//Если ЗначениеЗаполнено(ДокументОснование) тогда
	//	получитьстроку= ДокументОснование.Продукция.Получить(0);
	//	Продукция = получитьстроку.Номенклатура;
	//конецЕсли;
	////--- Жигалев 05.12.2023
		
КонецПроцедуры
